app/views/posts/index.html.haml

							%i.fa.fa-comments-o
							= post.comments.count
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]