app/views/posts/show.html.haml

				%i.fa.fa-comments-o
				= pluralize(@post.comments.count, "Comment")
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]

#comments
	%h2.comment_count= pluralize(@post.comments.count, "Comment")
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]