app/controllers/comments_controller.rb

	def create
		@post = Post.find(params[:post_id])
		@comment = Comment.create(params[:comment].permit(:content))
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "post_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "test"], ["post_id", 1], ["user_id", 1], ["created_at", "2021-03-04 16:57:06.484975"], ["updated_at", "2021-03-04 16:57:06.484975"]]