app/controllers/posts_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]
---
  def show
	@comments = Comment.where(post_id: @post)

INSERT INTO "posts" ("title", "link", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "test"], ["link", "test"], ["description", "ddd"], ["created_at", "2021-03-07 08:43:42.224168"], ["updated_at", "2021-03-07 08:43:42.224168"], ["user_id", 1]]
---
  def create
    @post = @post = current_user.posts.build(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "title" = $1, "link" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["title", "ice mountain"], ["link", "ice mountain"], ["updated_at", "2021-03-07 08:38:19.413778"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)